Put things here which are generally useful and defined in terms of dependencies which you expect to 
be in every project

#+BEGIN_SRC clojure :tangle core.clj
  (ns clj-vxe.core
    (:require 
     [me.raynes.conch.low-level]
     [yaml.core]
     [clojure.data.xml]
     [clj-http.client]
     [cemerick.pomegranate]
     [java-time])
    (:use
     [clojure.java.shell :only [sh]]))


#+END_SRC

** pretty print yaml
   #+BEGIN_SRC clojure :tangle core.clj
     (defn yaml-pp
       ([data] (println (yaml.core/generate-string data :dumper-options {:flow-style :block})))
       ([data path]   (spit (expand-home path) (yaml.core/generate-string data :dumper-options {:flow-style :block}))))
   #+END_SRC

   #+RESULTS:
   : #'home.core/pr-yaml
